<a href="https://colab.research.google.com/github/SriKrishna-GH/PYML_230901097/blob/main/daag.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [ ]:
import numpy as np
import pandas as pd
df=pd.DataFrame({"Name":["Alice","Bob","Charlie","Alice","Bob","Charlie"],"Catagory":["A","B","C","A","B","C"],"value":np.random.randint(1,5,size=6),"score":np.random.randint(60,100,size=6)})
print("\n Original DataFrame: \n",df)
df1=df.groupby(["Name"],as_index=False)["value"].sum()
print("\n Grouped by name and aggredation with one column sum:\n",df1)

 Original DataFrame:
       Name Catagory  value  score
0    Alice        A      4     89
1      Bob        B      4     91
2  Charlie        C      2     81
3    Alice        A      1     86
4      Bob        B      2     70
5  Charlie        C      1     73

 Grouped by name and aggredation with one column sum:
       Name  value
0    Alice      5
1      Bob      6
2  Charlie      3

In [ ]:
df2=df.groupby(('Name'),as_index=False)[['value','score']].sum()
print("\nGroup by name and Aggregation with two column:\n",df2)

Group by name and Aggregation with two column:
       Name  value  score
0    Alice      5    175
1      Bob      6    161
2  Charlie      3    154

In [ ]:
df3=df.groupby(('Name'),as_index=False)['value'].agg('sum')
print("\nGroup by name and Aggregation with one column using agg function:\n",df3)

Group by name and Aggregation with one column using agg function:
       Name  value
0    Alice      5
1      Bob      6
2  Charlie      3

In [ ]:
df4 = df.groupby('Name').agg({
'value': ['sum', 'mean', 'min', 'max'],
'score': ['sum', 'mean']})
print("\nGroup by name and multiple Aggregation functions :\n", df4)

Group by name and multiple Aggregation functions :
         value              score
          sum mean min max   sum  mean
Name
Alice       5  2.5   1   4   175  87.5
Bob         6  3.0   2   4   161  80.5
Charlie     3  1.5   1   2   154  77.0

In [ ]:
df5=df.groupby(("Name"),as_index=False)["value"].count()
print("\n Group and count:\n",df5)

 Group and count:
       Name  value
0    Alice      2
1      Bob      2
2  Charlie      2

In [ ]:
df6=df.groupby(("Name")).count()
print("\n Group and count:\n",df6)

 Group and count:
          Catagory  value  score
Name
Alice           2      2      2
Bob             2      2      2
Charlie         2      2      2

In [ ]:
df7=df.groupby(("Name"),as_index=False).first()
print("\n Group and display from first\n",df7)

 Group and display from first
       Name Catagory  value  score
0    Alice        A      4     89
1      Bob        B      4     91
2  Charlie        C      2     81

In [ ]:
df8=df.groupby(("Name"),as_index=False).last()
print("\n Group and display from last\n",df8)

 Group and display from last
       Name Catagory  value  score
0    Alice        A      1     86
1      Bob        B      2     70
2  Charlie        C      1     73

In [ ]:
df9=df.groupby(("Name")).first()
print("\n Group and display from first\n",df9)

 Group and display from first
         Catagory  value  score
Name
Alice          A      4     89
Bob            B      4     91
Charlie        C      2     81

In [ ]:
df10=df.groupby(("Name")).last()
print("\n Group and display from last\n",df10)

 Group and display from last
         Catagory  value  score
Name
Alice          A      1     86
Bob            B      2     70
Charlie        C      1     73